UTILIDAD/FUENTES MICROS/MS LATINIA/utilitarioms-master/utilitarioms-master/xml/processAccumulatedData.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0" xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">  
  <SOAP-ENV:Header> 
    <md:metadata> 
      <serviceId>processAccumulatedData</serviceId>  
      <serviceVersion>0.0</serviceVersion>
      <executingChannel> 
        <mnemonic>${mnemonic}</mnemonic> 
      </executingChannel>
      <executingOperatorId>${executingOperatorId}</executingOperatorId>
      <terminalId/>  
      <featureId>ROL@6028</featureId>
      <locale>es_AR</locale>  
    </md:metadata>  
  </SOAP-ENV:Header>  
  <SOAP-ENV:Body> 
<srv:processAccumulatedDataRequest xmlns:srv="http://www.technisys.net/cmm/services/processAccumulatedData/rq/v0.0">  
      <collection name="stringEntry">
                <stringEntry>
                    <key>companyId</key>
                    <value>${userId}</value>
                </stringEntry>
                <stringEntry>
                    <key>userId</key>
                    <value>${userId}</value>
                </stringEntry>
                <stringEntry>
                    <key>accountNumber</key>
                    <value>${accNumber}</value>
                </stringEntry>
                <stringEntry>
                    <key>amount</key>
                    <value>${amount}</value>
                </stringEntry>
                <stringEntry>
                    <key>processId</key>
                    <value>${processId}</value>
                </stringEntry>
                <stringEntry>
                    <key>serviceId</key>
                    <value>${serviceId}</value>
                </stringEntry>
                <stringEntry>
                    <key>variantId</key>
                    <value>${variantId}</value>
                </stringEntry>
                <stringEntry>
                    <key>channelId</key>
                    <value>IN</value>
                </stringEntry>
                <stringEntry>
                    <key>segment</key>
                    <value>${segment}</value>
                </stringEntry>
                <stringEntry>
                    <key>transactionDate</key>
                    <value>${transactionDate}</value>
                </stringEntry>
            </collection>
     </srv:processAccumulatedDataRequest> 
  </SOAP-ENV:Body> 
</SOAP-ENV:Envelope>